#შექმენი სია , სადაც შეინახავ შენს საყვარელ მანქაქნებს და კიდევ 3 არა საყვარელ მანქანას , შემდეგ შენი მიზანია ამ სიიდან ამოშალო 2 არასაყვარელი მანქანა pop() ფუნქციის გამოყენებით , შემდეგ append() ფუნქციის გამოყენებით სიის ბოლოში დაამატე შენთვის ყველაზე არასაყვარელი მანქანა რომელსაც ბოლო ადგილას გაიყვანდი , შემდეგ insert() ფუნქციის მეშვეობით მეორე ადგილას დაამატე მანქანა რომელსაც გაიყვანდი მეორე ადგილას შენი საყვარელი მანქანებიდან , საბოლოოდ კი დაბეჭდე განახლებული სია
fav_cars=["bmw" , "buggati" , "mercedec" , " tesla cybertruck" , "skoda"]
fav_cars.pop(4)
fav_cars.pop(2)
fav_cars.append("tesla")
fav_cars.insert(1, "ferrari")
print(fav_cars)